Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
     + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/03203d09a386ea5cbd0f9ed1fd3041c40c9dc49c80a2e765c08f18139cb4185a.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7751794803764930744" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip" -> "builds/03203d09a386ea5cbd0f9ed1fd3041c40c9dc49c80a2e765c08f18139cb4185a.zip"
          ~ "timestamp" = "1770000560523897000" -> "1770967299914869000"
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip" -> "builds/8ed5d67152d9983373eadf243e87eaf4f24e30383e7065d77308225376c5e9c6.zip"
        id                             = "sbeacon-backend-getMap"
      ~ last_modified                  = "2026-02-02T03:08:46.674+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getMap",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8ed5d67152d9983373eadf243e87eaf4f24e30383e7065d77308225376c5e9c6.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8ed5d67152d9983373eadf243e87eaf4f24e30383e7065d77308225376c5e9c6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4010794049261267008" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip" -> "builds/8ed5d67152d9983373eadf243e87eaf4f24e30383e7065d77308225376c5e9c6.zip"
          ~ "timestamp" = "1770000562548892000" -> "1770967299302130000"
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip" -> "builds/a83b90b07d81fdaf338fb8962535738e5c57ef1d2026c0424fb993f2f42c3357.zip"
        id                             = "sbeacon-backend-getProjects"
      ~ last_modified                  = "2026-02-02T03:08:22.285+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getProjects",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a83b90b07d81fdaf338fb8962535738e5c57ef1d2026c0424fb993f2f42c3357.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a83b90b07d81fdaf338fb8962535738e5c57ef1d2026c0424fb993f2f42c3357.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "471350245713793664" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip" -> "builds/a83b90b07d81fdaf338fb8962535738e5c57ef1d2026c0424fb993f2f42c3357.zip"
          ~ "timestamp" = "1770000562220818000" -> "1770967298036035000"
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip" -> "builds/73781be5250bcaf4aaf24ece1849486cc00a24731959dc5d471137a54aa6d0b8.zip"
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2026-02-02T03:09:35.097+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getRuns",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/73781be5250bcaf4aaf24ece1849486cc00a24731959dc5d471137a54aa6d0b8.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/73781be5250bcaf4aaf24ece1849486cc00a24731959dc5d471137a54aa6d0b8.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5692354831715009039" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip" -> "builds/73781be5250bcaf4aaf24ece1849486cc00a24731959dc5d471137a54aa6d0b8.zip"
          ~ "timestamp" = "1770000561499083000" -> "1770967297996761000"
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip" -> "builds/8007ced24308e53933e7398de210e004f76e73f7b404cbffd9c84a7a17ee77ec.zip"
        id                             = "sbeacon-backend-indexer"
      ~ last_modified                  = "2026-02-02T03:08:52.392+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/indexer",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8007ced24308e53933e7398de210e004f76e73f7b404cbffd9c84a7a17ee77ec.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8007ced24308e53933e7398de210e004f76e73f7b404cbffd9c84a7a17ee77ec.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3823849315143223699" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip" -> "builds/8007ced24308e53933e7398de210e004f76e73f7b404cbffd9c84a7a17ee77ec.zip"
          ~ "timestamp" = "1770000562297005800" -> "1770967299838502800"
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip" -> "builds/1c6f05cf94e679d05a191e689af2caeb357353baebbbef8fe886ddcfe6d5d0fc.zip"
        id                             = "sbeacon-backend-performQuery"
      ~ last_modified                  = "2026-02-02T03:08:05.292+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/performQuery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1c6f05cf94e679d05a191e689af2caeb357353baebbbef8fe886ddcfe6d5d0fc.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1c6f05cf94e679d05a191e689af2caeb357353baebbbef8fe886ddcfe6d5d0fc.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6626488422025138424" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip" -> "builds/1c6f05cf94e679d05a191e689af2caeb357353baebbbef8fe886ddcfe6d5d0fc.zip"
          ~ "timestamp" = "1770000560529229000" -> "1770967298135864000"
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip" -> "builds/a9972e580fb4d63629b661a74c33ffe8810db62c756e5e2d18cf66f75bd35671.zip"
        id                             = "sbeacon-backend-splitQuery"
      ~ last_modified                  = "2026-02-02T03:08:58.106+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/splitQuery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a9972e580fb4d63629b661a74c33ffe8810db62c756e5e2d18cf66f75bd35671.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a9972e580fb4d63629b661a74c33ffe8810db62c756e5e2d18cf66f75bd35671.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2462011467054062520" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip" -> "builds/a9972e580fb4d63629b661a74c33ffe8810db62c756e5e2d18cf66f75bd35671.zip"
          ~ "timestamp" = "1770000562702746000" -> "1770967299323892200"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:4c12e3920a3ab888eafc51419b539275ad243cd00a53c44c119bb46e8f93acd1" -> (known after apply)
      ~ last_modified                  = "2026-02-02T02:59:25.221+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip" -> "builds/733813585ef8949ac7aa2b9941519f421bc314b979ea5782d6df0e8467977192.zip"
        id                             = "sbeacon-backend-updateFiles"
      ~ last_modified                  = "2026-02-02T03:07:48.156+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/updateFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/733813585ef8949ac7aa2b9941519f421bc314b979ea5782d6df0e8467977192.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/733813585ef8949ac7aa2b9941519f421bc314b979ea5782d6df0e8467977192.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2325854019572918787" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip" -> "builds/733813585ef8949ac7aa2b9941519f421bc314b979ea5782d6df0e8467977192.zip"
          ~ "timestamp" = "1770000562154460000" -> "1770967299261612800"
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1" -> (known after apply)
      ~ code_sha256                 = "yJmDspL7dUp1nqIBFha/ZWBzVL8zj1iIPZ+YXrzMM+c=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-02T03:07:47.824+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/1e2523f5fa2234f0afb259eb5d4ddd0b103c1a82821f74a8aaaea7e26c3c6720.zip" -> "builds/cfd06f38a45ac0dcce8d6313730ae10ec71456824bb4cf0efa78d355574a5e20.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24452273 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20260202025003430300000001/builds/1e2523f5fa2234f0afb259eb5d4ddd0b103c1a82821f74a8aaaea7e26c3c6720.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "57328ff80c223b32de40640f73bd024c-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20260202025003430300000001/builds/1e2523f5fa2234f0afb259eb5d4ddd0b103c1a82821f74a8aaaea7e26c3c6720.zip" -> (known after apply)
      ~ key                           = "builds/1e2523f5fa2234f0afb259eb5d4ddd0b103c1a82821f74a8aaaea7e26c3c6720.zip" -> "builds/cfd06f38a45ac0dcce8d6313730ae10ec71456824bb4cf0efa78d355574a5e20.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/1e2523f5fa2234f0afb259eb5d4ddd0b103c1a82821f74a8aaaea7e26c3c6720.zip" -> "builds/cfd06f38a45ac0dcce8d6313730ae10ec71456824bb4cf0efa78d355574a5e20.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/cfd06f38a45ac0dcce8d6313730ae10ec71456824bb4cf0efa78d355574a5e20.zip"
              + quiet         = "true"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/cfd06f38a45ac0dcce8d6313730ae10ec71456824bb4cf0efa78d355574a5e20.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6413036471072604777" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1e2523f5fa2234f0afb259eb5d4ddd0b103c1a82821f74a8aaaea7e26c3c6720.zip" -> "builds/cfd06f38a45ac0dcce8d6313730ae10ec71456824bb4cf0efa78d355574a5e20.zip"
          ~ "timestamp" = "1770001660778029000" -> "1770967316284212200"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1" -> (known after apply)
      ~ code_sha256                 = "fgVWzvZPeU9faHywwtWmHtATuZzlxxesRubAJsTQ+eU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-02T02:51:46.335+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip" -> "builds/75f671fbec038d67a1de5f581e2edc99a692df3c592c307b129ccede1db3f3da.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120485 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20260202025003430300000001/builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "92dedb04fb8b99281bd292418380b23f" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20260202025003430300000001/builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip" -> (known after apply)
      ~ key                           = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip" -> "builds/75f671fbec038d67a1de5f581e2edc99a692df3c592c307b129ccede1db3f3da.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip" -> "builds/75f671fbec038d67a1de5f581e2edc99a692df3c592c307b129ccede1db3f3da.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/75f671fbec038d67a1de5f581e2edc99a692df3c592c307b129ccede1db3f3da.zip"
              + quiet         = "true"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/75f671fbec038d67a1de5f581e2edc99a692df3c592c307b129ccede1db3f3da.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9178393637657723960" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip" -> "builds/75f671fbec038d67a1de5f581e2edc99a692df3c592c307b129ccede1db3f3da.zip"
          ~ "timestamp" = "1770000561800182200" -> "1770967298101876000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip" -> "builds/d1d46aac16d813bbeb188cea604f2c4be2c35a59c7b5c9f019a118de554eff3a.zip"
        id                             = "security-sendSecurityAlert"
      ~ last_modified                  = "2026-02-02T02:52:03.052+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "security-infrastructure"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "security/lambda/sendSecurityAlert",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d1d46aac16d813bbeb188cea604f2c4be2c35a59c7b5c9f019a118de554eff3a.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d1d46aac16d813bbeb188cea604f2c4be2c35a59c7b5c9f019a118de554eff3a.plan.json"
      + id                   = (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1591600545565415686" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip" -> "builds/d1d46aac16d813bbeb188cea604f2c4be2c35a59c7b5c9f019a118de554eff3a.zip"
          ~ "timestamp" = "1770000562720310000" -> "1770967296936265000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip" -> "builds/022ce5da50da8f04769cc2098999699f04a8d73b485a3b56ef24be6d342d9aed.zip"
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2026-02-02T02:56:21.398+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/dbsnp",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/022ce5da50da8f04769cc2098999699f04a8d73b485a3b56ef24be6d342d9aed.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/022ce5da50da8f04769cc2098999699f04a8d73b485a3b56ef24be6d342d9aed.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2299831248238245346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip" -> "builds/022ce5da50da8f04769cc2098999699f04a8d73b485a3b56ef24be6d342d9aed.zip"
          ~ "timestamp" = "1770000560448463000" -> "1770967314551234000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip" -> "builds/05525a8ef5a26518f11e131613c7549266079402e2a0b66d3310ae2d733d211b.zip"
        id                             = "pgxflow-backend-gnomad"
      ~ last_modified                  = "2026-02-02T02:55:53.132+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/gnomad",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/05525a8ef5a26518f11e131613c7549266079402e2a0b66d3310ae2d733d211b.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/05525a8ef5a26518f11e131613c7549266079402e2a0b66d3310ae2d733d211b.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8754201719307996611" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip" -> "builds/05525a8ef5a26518f11e131613c7549266079402e2a0b66d3310ae2d733d211b.zip"
          ~ "timestamp" = "1770000560604605000" -> "1770967314500788000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/6a864c8b95fa4fa3d39884f6550e823153cc0ee3c5eebe5b01162205b870ba1b.zip" -> "builds/d46b9f6998a4e486ffeb22b2c389436e5089ca68b2d8bfde6409b6124f9908d7.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2026-02-02T02:56:10.114+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d46b9f6998a4e486ffeb22b2c389436e5089ca68b2d8bfde6409b6124f9908d7.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d46b9f6998a4e486ffeb22b2c389436e5089ca68b2d8bfde6409b6124f9908d7.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7321118716842833339" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6a864c8b95fa4fa3d39884f6550e823153cc0ee3c5eebe5b01162205b870ba1b.zip" -> "builds/d46b9f6998a4e486ffeb22b2c389436e5089ca68b2d8bfde6409b6124f9908d7.zip"
          ~ "timestamp" = "1770000560830673000" -> "1770967314429308000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/888ed94286fdd40813b5bbfae1039c39a0a133bfc8c7abcba88db8306bc18e99.zip" -> "builds/99f9f41ca73a70f7f103014539ec7b0ec9d19f7bab6b7042abf2aa7f1f94f358.zip"
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ last_modified                  = "2026-02-02T02:52:56.001+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/99f9f41ca73a70f7f103014539ec7b0ec9d19f7bab6b7042abf2aa7f1f94f358.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/99f9f41ca73a70f7f103014539ec7b0ec9d19f7bab6b7042abf2aa7f1f94f358.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8035930563446093384" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/888ed94286fdd40813b5bbfae1039c39a0a133bfc8c7abcba88db8306bc18e99.zip" -> "builds/99f9f41ca73a70f7f103014539ec7b0ec9d19f7bab6b7042abf2aa7f1f94f358.zip"
          ~ "timestamp" = "1770000560337814000" -> "1770967314392911000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:0f28080f144c81c9831e6e4cc9bfc3972396d2058e62767fb69a7fdee809ceeb997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:0f28080f144c81c9831e6e4cc9bfc3972396d2058e62767fb69a7fdee809ceeb" -> (known after apply)
        name         = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ repo_digest  = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:a92bdda4fff4dfa83973aa4a5335d2ecb5004b14a779336170f0e8f42e2e57fc" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "438047847d1b4bf73d8ffe7bdd9fe2a92a9870e0" -> "f982e040f7558d279bdee574f6293081baf5135f"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/pharmcat" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:a92bdda4fff4dfa83973aa4a5335d2ecb5004b14a779336170f0e8f42e2e57fc" -> (known after apply)
        name                 = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:a92bdda4fff4dfa83973aa4a5335d2ecb5004b14a779336170f0e8f42e2e57fc" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "438047847d1b4bf73d8ffe7bdd9fe2a92a9870e0" -> "f982e040f7558d279bdee574f6293081baf5135f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:5a254b1795cfed40a8fa85d479b094177549544fb68c4f33dff57af85a59a803997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:5a254b1795cfed40a8fa85d479b094177549544fb68c4f33dff57af85a59a803" -> (known after apply)
        name         = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ repo_digest  = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:e0f6f51565d5059323132e3262eb1e435753eaaa458d84b86d05a0f3557d8c74" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "11cb7055047bc9f56ba3fed775dc45a21d278559" -> "7d1e01bf8a633f1ca078a109844a2433a0a8437b"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/preprocessor" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:e0f6f51565d5059323132e3262eb1e435753eaaa458d84b86d05a0f3557d8c74" -> (known after apply)
        name                 = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:e0f6f51565d5059323132e3262eb1e435753eaaa458d84b86d05a0f3557d8c74" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "11cb7055047bc9f56ba3fed775dc45a21d278559" -> "7d1e01bf8a633f1ca078a109844a2433a0a8437b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip" -> "builds/73c140e08cdb3297d08f8da8f4ac0658c2b3f16b59a8b0839146c5330333fd9c.zip"
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ last_modified                  = "2026-02-02T02:55:58.867+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/gnomad",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/73c140e08cdb3297d08f8da8f4ac0658c2b3f16b59a8b0839146c5330333fd9c.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/73c140e08cdb3297d08f8da8f4ac0658c2b3f16b59a8b0839146c5330333fd9c.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3392618396825473480" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip" -> "builds/73c140e08cdb3297d08f8da8f4ac0658c2b3f16b59a8b0839146c5330333fd9c.zip"
          ~ "timestamp" = "1770000562653457000" -> "1770967314784490200"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:a92bdda4fff4dfa83973aa4a5335d2ecb5004b14a779336170f0e8f42e2e57fc" -> (known after apply)
      ~ last_modified                  = "2026-02-02T02:56:22.215+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip" -> "builds/0ab36057d622ece8300079afa28be1518cca75537335b6054eeaf83bd1f75e8f.zip"
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2026-02-02T02:56:15.800+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0ab36057d622ece8300079afa28be1518cca75537335b6054eeaf83bd1f75e8f.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0ab36057d622ece8300079afa28be1518cca75537335b6054eeaf83bd1f75e8f.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "665941664469997376" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip" -> "builds/0ab36057d622ece8300079afa28be1518cca75537335b6054eeaf83bd1f75e8f.zip"
          ~ "timestamp" = "1770000560734083000" -> "1770967314878345000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:e0f6f51565d5059323132e3262eb1e435753eaaa458d84b86d05a0f3557d8c74" -> (known after apply)
      ~ last_modified                  = "2026-02-02T02:59:44.267+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ccaa8157f3c620496c8603b80e4255df37adf3666234d8c1fa4a6f4ca1476806.zip" -> "builds/febfbcf890ea7531514867d1d5fa6e38cc3c36ea27fb411a6c97249fc5c3ee4f.zip"
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ last_modified                  = "2026-02-02T02:52:50.310+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/febfbcf890ea7531514867d1d5fa6e38cc3c36ea27fb411a6c97249fc5c3ee4f.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/febfbcf890ea7531514867d1d5fa6e38cc3c36ea27fb411a6c97249fc5c3ee4f.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6594625025670575570" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ccaa8157f3c620496c8603b80e4255df37adf3666234d8c1fa4a6f4ca1476806.zip" -> "builds/febfbcf890ea7531514867d1d5fa6e38cc3c36ea27fb411a6c97249fc5c3ee4f.zip"
          ~ "timestamp" = "1770000562238632000" -> "1770967314874255800"
        }
    }

Plan: 111 to add, 50 to change, 67 to destroy.
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=c2b0d03e-4208-d3a9-154d-047a42694d74]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=8902793689596064713]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0]: Creation complete after 0s [id=66f66ee1afcab7e21f4ee84a937556b05d903fda]
module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0]: Creation complete after 0s [id=5099c4b9a1f5b22076ad7ee21e56c6f3fd31bd90]
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creation complete after 0s [id=bd0b3c5a9d9fcad4166d3900a21e40ae9dade873]
module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0]: Creation complete after 0s [id=e43f2c185ca8e0407d8a501df3ae3356bb21c664]
module.error-catcher.module.lambda-notifyOnError.local_file.archive_plan[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.local_file.archive_plan[0]: Creation complete a
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.